neon-smart-studio/W-Link_NeonRTOS_Platform/src/Drivers/soc/MSPM0/driverlib/dl_unicommi2cc.h
    return (DL_I2CC_PEC_STATUS)(status);
}

/**
 *  @brief      Get the status of the SMBus/PMBus PEC Check error
 *
 *  The status of if a PEC check error occurred in the transaction that
 *  occurred before the last Stop. Latched on Stop.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     Status of PEC check error
 *
 *  @retval     One of @ref DL_I2CC_PEC_CHECK_ERROR
 */
__STATIC_INLINE DL_I2CC_PEC_CHECK_ERROR DL_I2CC_getPECCheckError(
    UNICOMM_Inst_Regs *unicomm)
{
    uint32_t error =
        unicomm->i2cc->PECSR & UNICOMMI2CC_PECSR_PECSTS_ERROR_MASK;

    return (DL_I2CC_PEC_CHECK_ERROR)(error);
}

/**
 *  @brief      Disable I2CC START generation
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_disableStartCondition(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->CTR &= ~(UNICOMMI2CC_CTR_START_MASK);
}

/**
 *  @brief      Checks if I2CC START generation is enabled
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If I2CC START generation is enabled
 *
 *  @retval     true if I2CC START generation is enabled
 *  @retval     false if I2CC START generation is disabled
 */
__STATIC_INLINE bool DL_I2CC_isStartConditionEnabled(
    UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2cc->CTR & UNICOMMI2CC_CTR_START_MASK) ==
            UNICOMMI2CC_CTR_START_ENABLE);
}

/**
 *  @brief      Enable I2CC START generation
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_enableStartCondition(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->CTR |= UNICOMMI2CC_CTR_START_ENABLE;
}

/**
 *  @brief      Disable I2CC STOP generation
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_disableStopCondition(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->CTR &= ~(UNICOMMI2CC_CTR_STOP_MASK);
}

/**
 *  @brief      Checks if I2CC STOP generation is enabled
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If I2CC STOP generation is enabled
 *
 *  @retval     true if I2CC STOP generation is enabled
 *  @retval     false if I2CC STOP generation is disabled
 */
__STATIC_INLINE bool DL_I2CC_isStopConditionEnabled(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2cc->CTR & UNICOMMI2CC_CTR_STOP_MASK) ==
            UNICOMMI2CC_CTR_STOP_ENABLE);
}

/**
 *  @brief      Enable I2CC STOP generation
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_enableStopCondition(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->CTR |= UNICOMMI2CC_CTR_STOP_ENABLE;
}

/**
 *  @brief      Disable I2CC data acknowledge (ACK or NACK)
 *
 *  When the I2CC module operates in receiver mode, the ACK bit can be
 *  cleared when no further data needs to be received from the target
 *  transmitter.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_disableACK(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->CTR &= ~(UNICOMMI2CC_CTR_ACK_MASK);
}

/**
 *  @brief      Checks if I2CC data acknowledge (ACK or NACK) is
 *              enabled
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If I2CC data acknowledge is enabled
 *
 *  @retval     true if I2CC data acknowledge is enabled
 *  @retval     false if I2CC data acknowledge is disabled
 */
__STATIC_INLINE bool DL_I2CC_isACKEnabled(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2cc->CTR & UNICOMMI2CC_CTR_ACK_MASK) ==
            UNICOMMI2CC_CTR_ACK_ENABLE);
}

/**
 *  @brief      Enable I2CC data acknowledge (ACK or NACK)
 *
 *  When the I2CC module operates in receiver mode, the ACK bit is
 *  normally set causing the I2CC bus to transmit an acknowledge
 *  automatically after each byte.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_enableACK(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->CTR |= UNICOMMI2CC_CTR_ACK_MASK;
}

/**
 *  @brief      Get transaction length in bytes
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     Length of I2CC transaction in bytes
 *
 *  @retval     [0x000, 0xfff]
 */
__STATIC_INLINE uint32_t DL_I2CC_getTransactionLength(
    UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2cc->CTR & UNICOMMI2CC_CTR_BLEN_MASK) >>
            UNICOMMI2CC_CTR_BLEN_OFS);
}

/**
 *  @brief      Set transaction length in bytes
 *
 *  @param[in]  unicomm         Pointer to the register overlay for the peripheral
 *
 *  @param[in]  length      Length of I2CC transaction in bytes [0x000, 0xfff]
 */
__STATIC_INLINE void DL_I2CC_setTransactionLength(
    UNICOMM_Inst_Regs *unicomm, uint32_t length)
{
    DL_Common_updateReg(&unicomm->i2cc->CTR,
        (length << UNICOMMI2CC_CTR_BLEN_OFS), UNICOMMI2CC_CTR_BLEN_MASK);
}

/**
 *  @brief      Get status of I2CC bus for
 *
 *  @param[in]  unicomm         Pointer to the register overlay for the peripheral
 *
 *  @return     Status of I2CC bus for
 *
 *  @retval     Bitwise OR of @ref DL_I2CC_STATUS
 */
__STATIC_INLINE uint32_t DL_I2CC_getStatus(UNICOMM_Inst_Regs *unicomm)
{
    return (unicomm->i2cc->SR);
}

/**
 *  @brief      Get transaction count in bytes
 *
 *  @param[in]  unicomm         Pointer to the register overlay for the peripheral
 *
 *  @return     Current 12-bit countdown value of the transaction
 *
 *  @retval     [0x000, 0xfff]
 */
__STATIC_INLINE uint16_t DL_I2CC_getTransactionCount(
    UNICOMM_Inst_Regs *unicomm)
{
    return ((uint16_t)((unicomm->i2cc->SR & UNICOMMI2CC_SR_BCNT_MASK) >>
                       UNICOMMI2CC_SR_BCNT_OFS));
}

/**
 *  @brief      Get byte of data from UNICOMMI2CC
 *
 *  If using FIFO, it is first byte from the RX FIFO.
 *
 *  @param[in]  unicomm         Pointer to the register overlay for the peripheral
 *
 *  @return     Last received byte of data
 *
 *  @retval     [0x00, 0xff]
 */
__STATIC_INLINE uint8_t DL_I2CC_receiveData(UNICOMM_Inst_Regs *unicomm)
{
    return ((uint8_t)(unicomm->i2cc->RXDATA & UNICOMMI2CC_RXDATA_DATA_MASK));
}

/**
 *  @brief      Set next byte to be transferred during the next transaction
 *
 *  Does not transmit data until @ref DL_I2CC_startTransfer
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @param[in]  data    Data to be transferred during the next transaction.
 *                      [0x00, 0xff]
 */
__STATIC_INLINE void DL_I2CC_transmitData(
    UNICOMM_Inst_Regs *unicomm, uint8_t data)
{
    unicomm->i2cc->TXDATA = data;
}

/**
 *  @brief      Get timer period
 *  This field is used in the equation to configure SCL_PERIOD:
 *
 *  SCL_PERIOD = (1 + TPR) * (SCL_LP + SCL_HP) * INT_CLK_PRD
 *
 *  where:
 *  SCL_PRD is the SCL line period (I2CC clock)
 *
 *  TPR is the Timer Period register value (range of 1 to 127)
 *
 *  SCL_LP is the SCL Low period (fixed at 6)
 *  SCL_HP is the SCL High period (fixed at 4)
 *
 *  CLK_PRD is the functional clock period in ns
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @return     Timer period
 *
 *  @retval     [0x00, 0x7f]
 */
__STATIC_INLINE uint8_t DL_I2CC_getTimerPeriod(UNICOMM_Inst_Regs *unicomm)
{
    return ((uint8_t)(unicomm->i2cc->TPR & UNICOMMI2CC_TPR_TPR_MASK));
}

/**
 *  @brief      Set timer period
 *  This field is used in the equation to configure SCL_PERIOD:
 *
 *  SCL_PERIOD = (1 + TPR) * (SCL_LP + SCL_HP) * INT_CLK_PRD
 *
 *  where:
 *  SCL_PRD is the SCL line period (I2CC clock)
 *
 *  TPR is the Timer Period register value (range of 1 to 127)
 *
 *  SCL_LP is the SCL Low period (fixed at 6)
 *  SCL_HP is the SCL High period (fixed at 4)
 *
 *  CLK_PRD is the functional clock period in ns
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @param[in]  period  Timer period [0x00, 0x7f]
 */
__STATIC_INLINE void DL_I2CC_setTimerPeriod(
    UNICOMM_Inst_Regs *unicomm, uint8_t period)
{
    unicomm->i2cc->TPR = period;
}

/**
 *  @brief      Disable multimode
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_disableMultiMode(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->CR &= ~(UNICOMMI2CC_CR_MCTL_MASK);
}

/**
 *  @brief      Checks if multimode is enabled
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If multimode is enabled
 *
 *  @retval     true if multimode is enabled
 *  @retval     false if multimode is disabled
 */
__STATIC_INLINE bool DL_I2CC_isMultiModeEnabled(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2cc->CR & UNICOMMI2CC_CR_MCTL_MASK) ==
            UNICOMMI2CC_CR_MCTL_ENABLE);
}

/**
 *  @brief      Enable multimode
 *
 *  In multimode, the SCL high time counts once the SCL line has been
 *  detected high. If this is not enabled, the high time counts as soon as the
 *  SCL line has been set high by the UNICOMMI2CC
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_enableMultiMode(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->CR |= UNICOMMI2CC_CR_MCTL_ENABLE;
}

/**
 *  @brief      Disable controller
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_disable(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->CR &= ~(UNICOMMI2CC_CR_ENABLE_MASK);
}

/**
 *  @brief      Checks if controller is enabled
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If is enabled
 *
 *  @retval     true if is enabled
 *  @retval     false if is disabled
 */
__STATIC_INLINE bool DL_I2CC_isEnabled(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2cc->CR & UNICOMMI2CC_CR_ENABLE_MASK) ==
            UNICOMMI2CC_CR_ENABLE_ENABLE);
}

/**
 *  @brief      Enable controller
 *
 *  After has enabled, it should not be re-enabled unless it has been
 *  disabled or by a reset, otherwise transfer failures may occur.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_enable(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->CR |= UNICOMMI2CC_CR_ENABLE_ENABLE;
}

/**
 *  @brief      Disable clock stretching
 *
 *  Clock stretching can be disabled if no target on the bus supports clock
 *  stretching; however, it should be typically enabled to be compliant with
 *  I2CC specification.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_disableClockStretching(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->CR &= ~(UNICOMMI2CC_CR_CLKSTRETCH_MASK);
}

/**
 *  @brief      Checks if clock stretching is enabled
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If clock stretching is enabled
 *
 *  @retval     true if clock stretching is enabled
 *  @retval     false if clock stretching is disabled
 */
__STATIC_INLINE bool DL_I2CC_isClockStretchingEnabled(
    UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2cc->CR & UNICOMMI2CC_CR_CLKSTRETCH_MASK) ==
            UNICOMMI2CC_CR_CLKSTRETCH_ENABLE);
}

/**
 *  @brief      Enable clock stretching
 *
 *  Clock stretching can be disabled if no target on the bus supports clock
 *  stretching; however, it should be typically enabled to be compliant with UNICOMMI2CC
 *  specification.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_enableClockStretching(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->CR |= UNICOMMI2CC_CR_CLKSTRETCH_ENABLE;
}

/**
 *  @brief      Get SCL signal status
 *
 *  @param[in]  unicomm         Pointer to the register overlay for the peripheral
 *
 *  @return     Status of SCL signal
 *
 *  @retval     One of @ref DL_I2CC_SCL
 */
__STATIC_INLINE DL_I2CC_SCL DL_I2CC_getSCLStatus(UNICOMM_Inst_Regs *unicomm)
{
    uint32_t sclStatus = unicomm->i2cc->BMON & UNICOMMI2CC_BMON_SCL_MASK;

